IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_mem_cfg_regs.xml
<module id="MEM_CFG_REGS" HW_revision="" description="MEM CFG Registers">
	<register id="DxLOCK" width="32" page="1" offset="0x0" internal="0" description="Dedicated RAM Config Lock Register">
		<bitfield id="LOCK_M0" description="M0 RAM Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_M1" description="M1 RAM Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_D0" description="D0 RAM Lock bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_D1" description="D1 RAM Lock bits" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_D2" description="D2 RAM Lock bits" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_D3" description="D3 RAM Lock bits" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_D4" description="D4 RAM Lock bits" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_D5" description="D5 RAM Lock bits" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_PIEVECT" description="PIEVECT RAM Lock bits" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="DxCOMMIT" width="32" page="1" offset="0x2" internal="0" description="Dedicated RAM Config Lock Commit Register">
		<bitfield id="COMMIT_M0" description="M0 RAM Permanent Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_M1" description="M1 RAM Permanent Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_D0" description="D0 RAM Permanent Lock bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_D1" description="D1 RAM Permanent Lock bits" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_D2" description="D2 RAM Permanent Lock bits" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_D3" description="D3 RAM Permanent Lock bits" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_D4" description="D4 RAM Permanent Lock bits" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_D5" description="D5 RAM Permanent Lock bits" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_PIEVECT" description="PIEVECT RAM Permanent Lock bits" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="DxACCPROT0" width="32" page="1" offset="0x8" internal="0" description="Dedicated RAM Config Register">
		<bitfield id="FETCHPROT_M0" description="Fetch Protection For M0 RAM" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_M0" description="CPU WR Protection For M0 RAM" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_M1" description="Fetch Protection For M1 RAM" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_M1" description="CPU WR Protection For M1 RAM" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_D0" description="Fetch Protection For D0 RAM" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_D0" description="CPU WR Protection For D0 RAM" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_D1" description="Fetch Protection For D1 RAM" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_D1" description="CPU WR Protection For D1 RAM" begin="25" end="25" width="1" rwaccess="RW"/>
	</register>
	<register id="DxACCPROT1" width="32" page="1" offset="0xa" internal="0" description="Dedicated RAM Config Register">
		<bitfield id="FETCHPROT_D2" description="Fetch Protection For D0 RAM" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_D2" description="CPU WR Protection For D2 RAM" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_D3" description="Fetch Protection For D3 RAM" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_D3" description="CPU WR Protection For D3 RAM" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_D4" description="Fetch Protection For D4 RAM" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_D4" description="CPU WR Protection For D4 RAM" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_D5" description="Fetch Protection For D5 RAM" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_D5" description="CPU WR Protection For D5 RAM" begin="25" end="25" width="1" rwaccess="RW"/>
	</register>
	<register id="DxTEST" width="32" page="1" offset="0x10" internal="0" description="Dedicated RAM TEST Register">
		<bitfield id="TEST_M0" description="Selects the different modes for M0 RAM" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="TEST_M1" description="Selects the different modes for M1 RAM" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="TEST_D0" description="Selects the different modes for D0 RAM" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="TEST_D1" description="Selects the different modes for D1 RAM" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="TEST_D2" description="Selects the different modes for D2 RAM" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="TEST_D3" description="Selects the different modes for D3 RAM" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="TEST_D4" description="Selects the different modes for D4 RAM" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="TEST_D5" description="Selects the different modes for D5 RAM" begin="15" end="14" width="2" rwaccess="RW"/>
	</register>
	<register id="DxINIT" width="32" page="1" offset="0x12" internal="0" description="Dedicated RAM Init Register">
		<bitfield id="INIT_M0" description="RAM Initialization control for M0 RAM." begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INIT_M1" description="RAM Initialization control for M1 RAM." begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INIT_D0" description="RAM Initialization control for D0 RAM." begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INIT_D1" description="RAM Initialization control for D1 RAM." begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INIT_D2" description="RAM Initialization control for D2 RAM." begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INIT_D3" description="RAM Initialization control for D3 RAM." begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INIT_D4" description="RAM Initialization control for D4 RAM." begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INIT_D5" description="RAM Initialization control for D5 RAM." begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="DxINITDONE" width="32" page="1" offset="0x14" internal="0" description="Dedicated RAM InitDone Status Register">
		<bitfield id="INITDONE_M0" description="RAM Initialization status for M0 RAM." begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_M1" description="RAM Initialization status for M1 RAM." begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_D0" description="RAM Initialization status for D0 RAM." begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_D1" description="RAM Initialization status for D1 RAM." begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_D2" description="RAM Initialization status for D2 RAM." begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_D3" description="RAM Initialization status for D3 RAM." begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_D4" description="RAM Initialization status for D4 RAM." begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_D5" description="RAM Initialization status for D5 RAM." begin="7" end="7" width="1" rwaccess="R"/>
	</register>
