IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_mem_cfg_regs.xml
	<register id="DxRAMTEST_LOCK" width="32" page="1" offset="0x16" internal="0" description="Lock register to Dx RAM TEST registers">
		<bitfield id="M0" description="DxTEST.TEST_M0 LOCK" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="M1" description="DxTEST.TEST_M1 LOCK" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="D0" description="DxTEST.TEST_D0 LOCK" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="D1" description="DxTEST.TEST_D1 LOCK" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="D2" description="DxTEST.TEST_D2 LOCK" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="D3" description="DxTEST.TEST_D3 LOCK" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="D4" description="DxTEST.TEST_D4 LOCK" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="D5" description="DxTEST.TEST_D5 LOCK" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="PIEVECT" description="DxTEST.TEST_PIEVECT LOCK" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key for writing DxRAMTEST_LOCK" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="LSxLOCK" width="32" page="1" offset="0x20" internal="0" description="Local Shared RAM Config Lock Register">
		<bitfield id="LOCK_LS0" description="LS0 RAM Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_LS1" description="LS1 RAM Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_LS2" description="LS2 RAM Lock bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_LS3" description="LS3 RAM Lock bits" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_LS4" description="LS4 RAM Lock bits" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_LS5" description="LS5 RAM Lock bits" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_LS6" description="LS6 RAM Lock bits" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_LS7" description="LS7 RAM Lock bits" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_LS8" description="LS8 RAM Lock bits" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_LS9" description="LS9 RAM Lock bits" begin="9" end="9" width="1" rwaccess="RW"/>
	</register>
	<register id="LSxCOMMIT" width="32" page="1" offset="0x22" internal="0" description="Local Shared RAM Config Lock Commit Register">
		<bitfield id="COMMIT_LS0" description="LS0 RAM Permanent Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_LS1" description="LS1 RAM Permanent Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_LS2" description="LS2 RAM Permanent Lock bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_LS3" description="LS3 RAM Permanent Lock bits" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_LS4" description="LS4 RAM Permanent Lock bits" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_LS5" description="LS5 RAM Permanent Lock bits" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_LS6" description="LS6 RAM Permanent Lock bits" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_LS7" description="LS7 RAM Permanent Lock bits" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_LS8" description="LS8 RAM Permanent Lock bits" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_LS9" description="LS9 RAM Permanent Lock bits" begin="9" end="9" width="1" rwaccess="RW"/>
	</register>
	<register id="LSxMSEL" width="32" page="1" offset="0x24" internal="0" description="Local Shared RAM Controller Sel Register">
		<bitfield id="MSEL_LS0" description="Controller Select for LS0 RAM" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MSEL_LS1" description="Controller Select for LS1 RAM" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MSEL_LS2" description="Controller Select for LS2 RAM" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MSEL_LS3" description="Controller Select for LS3 RAM" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MSEL_LS4" description="Controller Select for LS4 RAM" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MSEL_LS5" description="Controller Select for LS5 RAM" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MSEL_LS6" description="Controller Select for LS6 RAM" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MSEL_LS7" description="Controller Select for LS7 RAM" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MSEL_LS8" description="Controller Select for LS8 RAM" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MSEL_LS9" description="Controller Select for LS9 RAM" begin="19" end="18" width="2" rwaccess="RW"/>
	</register>
	<register id="LSxCLAPGM" width="32" page="1" offset="0x26" internal="0" description="Local Shared RAM Prog/Exe control Register">
		<bitfield id="CLAPGM_LS0" description="Selects LS0 RAM as program vs data memory for CLA" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLAPGM_LS1" description="Selects LS1 RAM as program vs data memory for CLA" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLAPGM_LS2" description="Selects LS2 RAM as program vs data memory for CLA" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CLAPGM_LS3" description="Selects LS3 RAM as program vs data memory for CLA" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CLAPGM_LS4" description="Selects LS4 RAM as program vs data memory for CLA" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CLAPGM_LS5" description="Selects LS5 RAM as program vs data memory for CLA" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CLAPGM_LS6" description="Selects LS6 RAM as program vs data memory for CLA" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CLAPGM_LS7" description="Selects LS7 RAM as program vs data memory for CLA" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
